[
  {
    "id": 1,
    "image": "https://shorturl.at/EKD9r",
    "title": "Focus Master",
    "companyName": "ZenTech Labs",
    "description": "This focus app takes the proven Pomodoro technique and makes it even more practical for modern lifestyles. Instead of just setting a timer, it builds a complete environment for deep work, minimizing distractions and maximizing concentration. Users can create custom work and break intervals, track how many sessions they complete each day, and review detailed statistics about their focus habits over time. The design is minimal and calming, reducing cognitive load so you can focus entirely on the task at hand. Notifications gently let you know when to pause and when to resume, helping you maintain a healthy rhythm between work and rest. A unique feature of this app is the integration of task lists with timers. You can assign each task to a specific Pomodoro session, making your schedule more structured. The built-in analytics show not only how much time you’ve worked but also which tasks consumed the most energy. This allows you to reflect on your efficiency and adjust your workflow accordingly. The app also includes optional background sounds such as white noise, nature sounds, or instrumental music to create a distraction-free atmosphere. For people who struggle with procrastination, the app provides motivational streaks and achievements. Completing multiple Pomodoro sessions unlocks milestones, giving a sense of accomplishment. This gamified approach makes focusing more engaging and less like a chore. Whether you’re studying for exams, coding, writing, or handling office work, the app adapts to your routine. By combining focus tracking, task management, and motivational tools, this Pomodoro app ensures that you not only work harder but also smarter. It is a personal trainer for your brain, keeping you disciplined, refreshed, and productive throughout the day.",
    "size": 120,
    "reviews": 3500,
    "ratingAvg": 4.7,
    "downloads": 120000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 2350 }
    ]
  },
  {
    "id": 2,
    "image": "https://cdn6.aptoide.com/imgs/8/e/2/8e270a27e139387f6f21bf6aab9743f5_icon.png",
    "title": "Fit Track Pro",
    "companyName": "Healthify Inc",
    "description": "FitTrack Pro is a comprehensive fitness tracker designed to help users monitor their health metrics seamlessly. From step counting and calorie tracking to heart rate monitoring, it offers a holistic approach to personal wellness. Users can set daily, weekly, and monthly fitness goals, while detailed analytics provide insights into trends and improvements over time. The app features guided workout routines, nutrition tips, and integration with wearable devices, making it easier to maintain a healthy lifestyle. The intuitive interface ensures users can quickly log meals, check progress, and receive personalized recommendations. Additionally, motivational challenges and achievements keep users engaged, turning fitness into a fun, gamified experience. Whether you’re a beginner or a professional athlete, FitTrack Pro adapts to your fitness level, offering a complete solution for long-term health management.",
    "size": 85,
    "reviews": 2400,
    "ratingAvg": 4.5,
    "downloads": 95000,
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1360 }
    ]
  },
  {
    "id": 3,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ5WoLC6IJKpHah5i6mMJlR_8E213_USl6A-crFtDEz5EFdqjVhWiQXwn71JMTziswwmPg",
    "title": "Budget Wise",
    "companyName": "FinancePro LLC",
    "description": "BudgetWise is a powerful personal finance app that allows users to take control of their money effortlessly. It provides tools for budgeting, tracking expenses, and analyzing spending habits. Users can create custom categories, set monthly limits, and receive notifications to prevent overspending. Detailed reports and charts visualize income and expenses, helping users identify areas for improvement. BudgetWise also supports goal-setting for savings and investments, offering tips for smarter financial decisions. The app integrates with bank accounts securely, automating transaction tracking and ensuring accurate data. For those who struggle with financial planning, it includes interactive tutorials, gamified milestones, and reminders to develop consistent money management habits. Whether you’re managing household expenses, planning a vacation, or saving for a big purchase, BudgetWise makes it simple and engaging.",
    "size": 75,
    "reviews": 1800,
    "ratingAvg": 4.6,
    "downloads": 85000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 1030 }
    ]
  },
  {
    "id": 4,
    "image": "https://play-lh.googleusercontent.com/ObrldQFJ5XfX1j8oBsG7rHIpn_0QBLHA1YPUgiB-KbLBHKwsWQtJc45wzPr7ognC",
    "title": "Learn Lang",
    "companyName": "EduWorld",
    "description": "LearnLang is a language learning app that transforms the way users acquire new languages. Using interactive lessons, real-world dialogues, and AI-powered pronunciation feedback, it helps learners develop listening, speaking, reading, and writing skills effectively. Users can choose from multiple languages and customize their learning paths based on proficiency levels. Daily challenges, quizzes, and streak tracking motivate continuous learning, while gamified elements make practicing fun. The app also features spaced repetition for vocabulary retention, conversation practice with native speakers, and cultural tips for immersive learning. With LearnLang, mastering a language becomes engaging, structured, and achievable for users of all ages.",
    "size": 95,
    "reviews": 2100,
    "ratingAvg": 4.8,
    "downloads": 110000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1340 }
    ]
  },
  {
    "id": 5,
    "image": "https://m.media-amazon.com/images/I/31iBYed0oUL.png",
    "title": "Photo Fusion",
    "companyName": "CreativeSoft",
    "description": "PhotoFusion is an advanced photo editing app designed for both beginners and professionals. It offers a wide array of tools including filters, layers, masks, and AI-powered enhancements. Users can remove backgrounds, adjust lighting, correct colors, and create stunning compositions with ease. The app supports high-resolution exports and integrates with social media platforms for instant sharing. Tutorials and templates help users learn creative techniques while saving time. PhotoFusion also includes batch editing features, allowing users to process multiple images simultaneously. Whether you want to enhance personal photos or create professional graphics, this app provides the flexibility, creativity, and precision needed for high-quality visual content.",
    "size": 150,
    "reviews": 3200,
    "ratingAvg": 4.7,
    "downloads": 130000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 1700 }
    ]
  },
  {
    "id": 6,
    "image": "https://play-lh.googleusercontent.com/Nv7IKTZZdVa_Bhx2dY45V0kVWTupb8UyTzI9BovC3aw8gpx6xU3K8J55SNysvNXUng=w240-h480-rw",
    "title": "Mind Relax",
    "companyName": "Calmify",
    "description": "MindRelax is a meditation and mindfulness app designed to reduce stress and improve mental clarity. It features guided meditation sessions, breathing exercises, sleep stories, and calming background sounds. Users can track their meditation streaks and monitor their mental wellness over time. The app offers programs tailored for stress relief, focus enhancement, and better sleep. MindRelax also integrates mood tracking, journaling, and mindfulness reminders to help users maintain consistent habits. The design is soothing, encouraging users to engage regularly without feeling overwhelmed. Whether you’re a beginner or an experienced meditator, MindRelax provides a structured yet flexible approach to improving mental health and emotional resilience.",
    "size": 60,
    "reviews": 1500,
    "ratingAvg": 4.5,
    "downloads": 70000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 830 }
    ]
  },
  {
    "id": 7,
    "image": "https://play-lh.googleusercontent.com/Voya0jfoXVuGGSL_9DRWsnZr_Okr7Wcse_v_Ow31yDN_MGBd-Truu-W3W9ee5yFcLQ=w240-h480-rw",
    "title": "Recipe Master",
    "companyName": "CookEase",
    "description": "RecipeMaster is a comprehensive cooking app for food enthusiasts of all levels. It offers thousands of recipes from around the world with step-by-step instructions, ingredient lists, and video tutorials. Users can create meal plans, save favorite recipes, and generate shopping lists automatically. The app adapts recipes based on dietary preferences, serving sizes, and available ingredients. With features like cooking timers, instructional tips, and community sharing, RecipeMaster makes cooking enjoyable and educational. Users can also participate in challenges, share creations, and gain inspiration from other home chefs, making it a complete platform for culinary exploration.",
    "size": 140,
    "reviews": 2600,
    "ratingAvg": 4.6,
    "downloads": 95000,
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1370 }
    ]
  },
  {
    "id": 8,
    "image": "https://play-lh.googleusercontent.com/qzd5vlydFBIqYusKaQbrHSBsXPM4yi5kHuuspRPu-fTyw7bFwvthksMiSEGY1cUcJuw",
    "title": "Travel Buddy",
    "companyName": "Wanderlust Inc",
    "description": "TravelBuddy is a travel planning app that helps users organize trips effortlessly. It provides itinerary creation, destination suggestions, budget planning, and real-time maps. Users can save favorite places, track expenses, and receive alerts for flight changes or local events. The app also includes travel guides, packing lists, and community recommendations. Interactive features like travel journals and photo sharing allow users to document and share experiences. TravelBuddy is perfect for both casual travelers and adventure enthusiasts, simplifying the process of planning, navigating, and enjoying trips around the world.",
    "size": 110,
    "reviews": 1900,
    "ratingAvg": 4.6,
    "downloads": 80000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 940 }
    ]
  },
  {
    "id": 9,
    "image": "https://img.freepik.com/premium-vector/purple-3d-music-icon-violet-isolated-button-vector-illustration_541075-149.jpg",
    "title": "Music Flow",
    "companyName": "SoundWave Studios",
    "description": "MusicFlow is a music streaming and discovery app offering curated playlists, radio stations, and on-demand songs. Users can explore genres, create custom playlists, and follow artists for the latest releases. The app includes offline playback, high-quality audio streaming, and personalized recommendations powered by AI. MusicFlow also offers social sharing, collaborative playlists, and live sessions with artists, making music listening interactive and enjoyable. Whether for relaxation, workouts, or parties, MusicFlow provides a complete platform for music lovers to discover and enjoy songs effortlessly.",
    "size": 130,
    "reviews": 2800,
    "ratingAvg": 4.7,
    "downloads": 125000,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1540 }
    ]
  },
  {
    "id": 10,
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/d1/51/32/d1513249-f2de-b042-0437-3f4a0da98e71/AppIcon-0-0-1x_U007ephone-0-0-85-220.jpeg/256x256bb.jpg",
    "title": "Daily Journal",
    "companyName": "MindSpace",
    "description": "DailyJournal is a digital journaling app that encourages users to reflect on their day, track moods, and cultivate gratitude. It features customizable prompts, habit tracking, and secure cloud storage. Users can add text, images, or voice notes, and the app provides analytics on mood trends and journaling consistency. With reminders and motivational quotes, DailyJournal helps users build a mindful daily routine. Its clean, minimal design ensures distraction-free writing and personal reflection. Whether for mental wellness, self-growth, or creative expression, DailyJournal is a flexible companion for personal development.",
    "size": 50,
    "reviews": 1200,
    "ratingAvg": 4.5,
    "downloads": 60000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 580 }
    ]
  },
  {
    "id": 11,
    "image": "https://play-lh.googleusercontent.com/VBQs__I_b13r5btJDYDBwzbCStcFeSiuCejXMp0GMxWPvQPvXreqbLhtKw17EFIYidY",
    "title": "Sleep Well",
    "companyName": "RestTech",
    "description": "SleepWell is a sleep tracking and relaxation app that helps users improve their sleep quality. It provides sleep cycle analysis, smart alarms, soothing sounds, bedtime routines, and relaxation techniques. Users can log sleep patterns and receive personalized insights to optimize rest. The app integrates meditation exercises, white noise, and breathing routines for better sleep. SleepWell encourages healthy sleep habits and helps users understand factors affecting rest, making it a holistic solution for better sleep and overall well-being.",
    "size": 65,
    "reviews": 1500,
    "ratingAvg": 4.6,
    "downloads": 72000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 710 }
    ]
  },
  {
    "id": 12,
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple221/v4/54/64/78/54647826-b927-1ad0-9295-be3ddca34d19/AppIcon-0-0-1x_U007epad-0-11-0-85-220.png/512x512bb.jpg",
    "title": "Art Space",
    "companyName": "CreativeHub",
    "description": "ArtSpace is an art creation and learning app where users can explore drawing, painting, and digital art techniques. It provides tutorials, brushes, layers, and AI-assisted suggestions. Users can create artwork, join challenges, and share creations in a vibrant community. ArtSpace encourages skill development and creativity while offering a flexible and intuitive interface. Gamified achievements and progress tracking keep users motivated, making art practice fun and engaging for beginners and professionals alike.",
    "size": 145,
    "reviews": 2200,
    "ratingAvg": 4.7,
    "downloads": 102000,
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 980 }
    ]
  },
  {
    "id": 13,
    "image": "https://i.pinimg.com/736x/7b/4a/bf/7b4abfeed18b5759094e78aec35c8496.jpg",
    "title": "News Flash",
    "companyName": "InfoStream",
    "description": "NewsFlash is a news aggregation app delivering personalized news from multiple sources in real-time. Users can select topics of interest, save articles for later, and receive breaking news alerts. The app includes features like offline reading, text-to-speech, and interactive media content. With AI-powered recommendations, NewsFlash ensures that users stay informed efficiently. Its clean and intuitive interface reduces clutter and helps focus on essential stories, making it perfect for busy readers seeking quick, accurate news updates.",
    "size": 80,
    "reviews": 1700,
    "ratingAvg": 4.5,
    "downloads": 85000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 890 }
    ]
  },
  {
    "id": 14,
    "image": "https://cdn.prod.website-files.com/65a6a15ecd9b4909597c6be5/6619902d60c9a9d244cdc6c7_codebuddy-og.png",
    "title": "Code Buddy",
    "companyName": "DevTools Co",
    "description": "CodeBuddy is an interactive coding and learning platform for developers of all levels. It offers tutorials, code challenges, syntax highlighting, and AI-assisted suggestions. Users can practice programming languages, work on projects, and receive instant feedback. The app features gamified challenges, achievement tracking, and collaborative coding options. CodeBuddy also includes a built-in code editor and supports multiple programming environments. Whether learning from scratch or enhancing professional skills, CodeBuddy makes coding accessible, structured, and fun.",
    "size": 110,
    "reviews": 2000,
    "ratingAvg": 4.7,
    "downloads": 95000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 940 }
    ]
  },
  {
    "id": 15,
    "image": "https://play-lh.googleusercontent.com/QFrTt0o3AIKBDFIcPfPB4LeaWn719ETqbXgXtkMpo4Z5_pKoggqmD_0Zfuk27X0ByesK",
    "title": "Shop Easy",
    "companyName": "RetailPro",
    "description": "ShopEasy is a shopping and deals app offering a wide range of products with personalized recommendations. Users can browse categories, compare prices, and save favorite items. The app includes secure payments, order tracking, and notifications for deals and discounts. ShopEasy also features wishlists, reviews, and AI-driven suggestions for a smarter shopping experience. Whether buying daily essentials or luxury items, ShopEasy simplifies shopping with convenience and efficiency.",
    "size": 90,
    "reviews": 2100,
    "ratingAvg": 4.6,
    "downloads": 110000,
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 970 }
    ]
  },
  {
    "id": 16,
    "image": "https://cdn.dribbble.com/userupload/24002213/file/original-026e71e116d8f0f0cbc50136b3170a19.gif",
    "title": "Weather Now",
    "companyName": "ClimateTech",
    "description": "WeatherNow provides accurate, real-time weather updates and forecasts for users worldwide. It includes hourly, daily, and weekly forecasts, severe weather alerts, radar maps, and interactive visuals. Users can customize notifications, track multiple locations, and access weather news. The app's clean interface and AI-powered predictions help users plan their day effectively. WeatherNow is ideal for outdoor enthusiasts, travelers, and anyone who wants reliable weather insights at a glance.",
    "size": 60,
    "reviews": 1600,
    "ratingAvg": 4.5,
    "downloads": 78000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 930 }
    ]
  },
  {
    "id": 17,
    "image": "https://play-lh.googleusercontent.com/eyFLLJSkFkvVp22ImC8TZNRBrK94BVziu8uUrsjMaW9-pvWjBPEfh3iE3nlux7YNwxY=s256-rw",
    "title": "Yoga Flow",
    "companyName": "WellnessCo",
    "description": "YogaFlow is a yoga and wellness app designed to help users improve flexibility, strength, and mental clarity. It offers guided sessions, posture instructions, breathing exercises, and meditation routines. Users can create personalized routines, track progress, and receive reminders to maintain consistency. YogaFlow includes programs for beginners, intermediate, and advanced levels. Its clean design and instructional videos make practicing yoga engaging and safe. The app promotes holistic wellness and mindfulness through daily practice.",
    "size": 95,
    "reviews": 1500,
    "ratingAvg": 4.7,
    "downloads": 85000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 880 }
    ]
  },
  {
    "id": 18,
    "image": "https://techwiser.com/wp-content/uploads/2017/02/Mind-Map-Apps.jpg",
    "title": "Mind Map Pro",
    "companyName": "BrainTools",
    "description": "MindMap Pro helps users organize ideas visually using mind maps, flowcharts, and diagrams. It supports collaboration, project planning, and brainstorming. Users can attach files, add notes, and use color-coded nodes for clarity. MindMap Pro enhances creativity and productivity by providing an intuitive, interactive workspace. Templates and AI-assisted suggestions speed up idea generation, making it suitable for students, professionals, and teams.",
    "size": 120,
    "reviews": 1700,
    "ratingAvg": 4.6,
    "downloads": 80000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 910 }
    ]
  },
  {
    "id": 19,
    "image": "https://www.ecoworldservices.co.ke/wp-content/uploads/2017/02/Event-Management.png",
    "title": "Event Planner",
    "companyName": "OrganizeIt",
    "description": "EventPlanner is an app for organizing personal and professional events seamlessly. It offers calendar integration, task management, budget tracking, guest invitations, RSVPs, and reminders. Users can collaborate with team members, track deadlines, and generate schedules. The app simplifies planning for weddings, parties, conferences, and corporate events. Notifications and analytics ensure everything runs smoothly. EventPlanner combines practicality and creativity, making event management stress-free and efficient.",
    "size": 100,
    "reviews": 1300,
    "ratingAvg": 4.5,
    "downloads": 70000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 680 }
    ]
  },
  {
    "id": 20,
    "image": "https://cdn2.iconfinder.com/data/icons/metro-ui-dock/512/Task_Manager.png",
    "title": "Stock Watcher",
    "companyName": "Finance Hub",
    "description": "StockWatcher is an investment tracking and stock market analysis app. It provides real-time quotes, news, portfolio tracking, and market insights. Users can create watchlists, set alerts, and follow companies. Interactive charts and analytics help in making informed investment decisions. StockWatcher is ideal for beginners and professionals, offering tools to monitor and optimize financial growth.",
    "size": 110,
    "reviews": 2000,
    "ratingAvg": 4.6,
    "downloads": 95000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 940 }
    ]
  },
  {
    "id": 21,
    "image": "https://img.freepik.com/premium-vector/pet-care-logo-design_626969-90.jpg?w=1480",
    "title": "PetCare",
    "companyName": "Animal Soft",
    "description": "PetCare is a pet management app designed for pet owners to track health, appointments, diet, and activities. It provides reminders for vaccinations, medication, grooming, and vet visits. Users can log daily activities and monitor pet growth. PetCare also offers training tips and community support for pet lovers. The app ensures pets remain healthy and well-cared for with organized tracking and guidance.",
    "size": 80,
    "reviews": 1400,
    "ratingAvg": 4.6,
    "downloads": 78000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 710 }
    ]
  },
  {
    "id": 22,
    "image": "https://images-platform.99static.com/11t1E3FFJP1yTXmWx-2ibv3UJBA=/138x138:1245x1245/500x500/top/smart/99designs-contests-attachments/111/111674/attachment_111674551",
    "title": "Grocery Pal",
    "companyName": "ShopSmart",
    "description": "GroceryPal helps users manage grocery shopping efficiently. It offers smart shopping lists, pantry inventory, price comparisons, and recipe suggestions. Users can plan meals, track purchases, and receive reminders for restocking. The app integrates with local stores for delivery or pickup, making grocery shopping convenient and cost-effective.",
    "size": 90,
    "reviews": 1600,
    "ratingAvg": 4.5,
    "downloads": 80000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 940 }
    ]
  },
  {
    "id": 23,
    "image": "https://images.dwncdn.net/images/t_app-icon-l/p/07499da2-96d2-11e6-998b-00163ec9f5fa/2296900528/12511_4-10339154-logo",
    "title": "PhotoStory",
    "companyName": "Snap Media",
    "description": "PhotoStory is a creative storytelling app that lets users combine photos, videos, and music to make interactive stories. Users can add text, effects, and voiceovers to create personalized memories or professional presentations. The app features templates, collaboration, and social sharing options. PhotoStory encourages creativity, making it easy to produce polished content with minimal effort.",
    "size": 140,
    "reviews": 2000,
    "ratingAvg": 4.7,
    "downloads": 105000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 890 }
    ]
  },
  {
    "id": 24,
    "image": "https://r2.erweima.ai/imgcompressed/compressed_fdcfd76a4e687ceb1bf6f3494ea94832.webp",
    "title": "Language Hub",
    "companyName": "Polyglot Inc",
    "description": "LanguageHub offers comprehensive courses for multiple languages, combining grammar lessons, vocabulary drills, speaking practice, and interactive quizzes. Users can learn at their own pace and track progress over time. The app provides real-life scenarios, AI conversation partners, and gamified achievements to enhance engagement. LanguageHub ensures effective and enjoyable learning for beginners and advanced learners.",
    "size": 100,
    "reviews": 1800,
    "ratingAvg": 4.6,
    "downloads": 90000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 1010 }
    ]
  },
  {
    "id": 25,
    "image": "https://static.vecteezy.com/system/resources/previews/027/334/197/non_2x/task-manager-icon-vector.jpg",
    "title": "Task Manager Pro",
    "companyName": "Productive Apps",
    "description": "TaskManager Pro helps users organize tasks, projects, and deadlines efficiently. It includes task lists, priorities, reminders, calendar integration, and collaboration tools. Users can track progress, visualize timelines, and receive notifications. The app supports recurring tasks, subtasks, and project templates. TaskManager Pro is perfect for individuals and teams looking to enhance productivity, plan workloads, and meet deadlines with ease.",
    "size": 85,
    "reviews": 1700,
    "ratingAvg": 4.5,
    "downloads": 82000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 1040 }
    ]
  },
  {
    "id": 26,
    "image": "https://images-platform.99static.com/kgH956IkWo3IZOaRTjj5w31b3cg=/500x500/top/smart/99designs-contests-attachments/11/11715/attachment_11715103",
    "title": "Meditate Now",
    "companyName": "CalmLife",
    "description": "MeditateNow offers guided meditations, breathing exercises, and mindfulness programs for stress reduction and mental clarity. Users can track meditation streaks, mood changes, and sleep quality. The app provides a variety of themes, background sounds, and personalized meditation plans. MeditateNow encourages daily practice, offering reminders, achievements, and progress analytics. Suitable for beginners and experienced practitioners, it promotes relaxation, focus, and emotional balance.",
    "size": 70,
    "reviews": 1400,
    "ratingAvg": 4.6,
    "downloads": 75000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 780 }
    ]
  },
  {
    "id": 27,
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcReofsHIrdwsxNF9NsPygp4S-u1rGJzTMLgOw&s",
    "title": "Recipe Box",
    "companyName": "Food Tech",
    "description": "RecipeBox is a cooking and recipe management app, allowing users to discover, save, and organize recipes. It offers step-by-step instructions, videos, and ingredient lists. Users can create meal plans, generate shopping lists, and share recipes with the community. RecipeBox adapts to dietary preferences, serving sizes, and seasonal ingredients. Gamified cooking challenges and achievements keep users engaged and inspired to explore new culinary skills.",
    "size": 130,
    "reviews": 1900,
    "ratingAvg": 4.7,
    "downloads": 98000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 840 }
    ]
  },
  {
    "id": 28,
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple211/v4/f3/5e/66/f35e66b8-406e-e916-9b5f-f3bf845cdce0/AppIcon-0-0-1x_U007epad-0-1-0-0-sRGB-0-85-220.png/1024x1024.jpg",
    "title": "Workout Pal",
    "companyName": "FitTech",
    "description": "WorkoutPal is a personal fitness companion offering guided workouts, exercise routines, progress tracking, and personalized fitness plans. Users can follow strength training, cardio, HIIT, and flexibility programs. The app provides instructional videos, performance analytics, and motivational challenges to ensure consistent engagement. WorkoutPal adapts plans based on fitness level and goals. Whether aiming to lose weight, gain strength, or improve endurance, the app supports users in achieving fitness milestones effectively and safely.",
    "size": 120,
    "reviews": 2000,
    "ratingAvg": 4.7,
    "downloads": 1000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 940 }
    ]
  }
]
